import math


def area(r):
    '''
        Принимает число r (радиус круга), возвращает площадь круга.

        Параметры:
            r (float): радиус круга.

        Возвращаемое значение:
            area (float): площадь круга.

        Пример вызова:
            area(3)
            28.274333882308138
    '''
    return math.pi * r * r


def perimeter(r):
    '''
        Принимает число r (радиус круга), возвращает периметр круга.

        Параметры:
            r (float): радиус круга.

        Возвращаемое значение:
            perimetr (float): периметр круга.

        Пример вызова:
            perimeter(3)
            18.84955592153876
    '''
    return 2 * math.pi * r

