def area(a, b):
    '''
        Принимает числа a и b (стороны прямоугольника), возвращает площадь прямоугольника.

        Параметры:
            a : первая сторона прямоугольника.
            b : вторая сторона прямоугольника.

        Возвращаемое значение:
            area : площадь прямоугольника.

        Пример вызова:
            area(5, 3)
            15
    '''
    return a * b


def perimeter(a, b):
    '''
        Принимает числа a и b (стороны прямоугольника), возвращает периметр прямоугольника.

        Параметры:
            a : первая сторона прямоугольника.
            b : вторая сторона прямоугольника.

        Возвращаемое значение:
            perimeter : периметр прямоугольника.

        Пример вызова:
            perimeter(5, 3)
            16
    '''
    return 2 * (a + b)
