
def area(a):
    '''
            Принимает число а (сторону квадрата), возвращает площадь квадрата.

            Параметры:
                a (int/float): сторона квадрата.

            Возвращаемое значение:
                area (int/float): площадь квадрата.

            Пример вызова:
                area(5)
                25
    '''
    return a * a


def perimeter(a):
    '''
        Принимает число а (сторону квадрата), возвращает периметр квадрата.

        Параметры:
            a (int/float): сторона квадрата.

        Возвращаемое значение:
            perimeter (int/float): периметр квадрата.

        Пример вызова:
            perimeter(5)
            20
        '''
    return 4 * a
