def area(a, h):
    '''
        Принимает числа a и h (основание и высоту треугольника), возвращает площадь треугольника.

        Параметры:
            a : основание треугольника.
            h : высота, проведённая к этому основанию.

        Возвращаемое значение:
            area : площадь треугольника.

        Пример вызова:
            area(4, 3)
            6.0
    '''
    return a * h / 2


def perimeter(a, b, c):
    '''
        Принимает числа a, b и c (стороны треугольника), возвращает периметр треугольника.

        Параметры:
            a : первая сторона треугольника.
            b : вторая сторона треугольника.
            c : третья сторона треугольника.

        Возвращаемое значение:
            perimeter : периметр треугольника.

        Пример вызова:
            perimeter(3, 4, 5)
            12
    '''
    return a + b + c
