def area(a, h):
    '''
        Принимает числа a и h (основание и высоту треугольника), возвращает площадь треугольника.

        Параметры:
            a (float): основание треугольника.
            h (float): высота, проведённая к этому основанию.

        Возвращаемое значение:
            area (float): площадь треугольника.

        Пример вызова:
            area(4, 3)
            6.0
    '''
    return a * h / 2


def perimeter(a, b, c):
    '''
        Принимает числа a, b и c (стороны треугольника), возвращает периметр треугольника.

        Параметры:
            a (float): первая сторона треугольника.
            b (float): вторая сторона треугольника.
            c (float): третья сторона треугольника.

        Возвращаемое значение:
            perimeter (float): периметр треугольника.

        Пример вызова:
            perimeter(3, 4, 5)
            12
    '''
    return a + b + c
